<a href="https://colab.research.google.com/github/skdding3/Code-Practice/blob/main/Group_by_%EC%98%A4%EC%99%80%EC%97%B4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Group by

In [1]:
import pandas as pd
import numpy as np


df = pd.DataFrame({
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]
                  })

df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [2]:
df.groupby('city').mean() #city를 묶어서 평균값을 구함

      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0

In [3]:
df.groupby(['city', 'fruits']).mean() #city를 그룹화 이후에 fruits 그룹화

             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0

In [6]:
df.groupby(['city', 'fruits'], as_index=False).mean() #Don't use index label

  city  fruits  price  quantity
0   부산   apple  100.0       1.0
1   부산  banana  275.0       3.5
2   부산  orange  200.0       2.0
3   서울   apple  175.0       5.5
4   서울  banana  400.0       7.0

In [7]:
df.groupby('city').get_group('부산') #그룹내 데이터 체크시 사용 ex) city에서 부산항목 체크

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4

In [8]:
df.groupby('city').size() #data dimension

city
부산    4
서울    3
dtype: int64

In [9]:
df.groupby('city').size()['부산'] #부산 size check

4

In [10]:
df.groupby('city').agg(np.mean) #city 별로 가격과 수량 평균

      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0

In [11]:
def my_mean(s):                   #가격의 평균과 수량의 합계를 동시에 구하고 싶은 경우
    return np.mean(s)

df.groupby('city').agg({'price': my_mean, 'quantity': np.sum})  #quantity는 수량이 합해짐

      price  quantity
city
부산    212.5        10
서울    250.0        18